# ExportLinetypeKey Properties

---
The ExportLinetypeKey type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| OriginalLinetypeName|  The original linetype name.
Top
#### Reference
ExportLinetypeKey Class
Autodesk.Revit.DB Namespace